VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_frc.h
/***************************************************************************//**
 * @file
 * @brief EFR32FG1V_CRC register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/***************************************************************************//**
 * @defgroup EFR32FG1V_FRC
 * @{
 * @brief EFR32FG1V_FRC Register Declaration
 ******************************************************************************/
/* =========================================================================================================================== */
/* ================                                            FRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Frame controller (FRC)
  */

typedef struct {                                /*!< (@ 0x40080000) FRC Structure                                              */
  __IM  uint32_t  STATUS;                       /*!< (@ 0x00000000) STATUS                                                     */
  __IOM uint32_t  DFLCTRL;                      /*!< (@ 0x00000004) DFLCTRL                                                    */
  __IOM uint32_t  MAXLENGTH;                    /*!< (@ 0x00000008) MAXLENGTH                                                  */
  __IOM uint32_t  ADDRFILTCTRL;                 /*!< (@ 0x0000000C) ADDRFILTCTRL                                               */
  __IOM uint32_t  DATABUFFER;                   /*!< (@ 0x00000010) DATABUFFER                                                 */
  __IOM uint32_t  WCNT;                         /*!< (@ 0x00000014) WCNT                                                       */
  __IOM uint32_t  WCNTCMP0;                     /*!< (@ 0x00000018) WCNTCMP0                                                   */
  __IOM uint32_t  WCNTCMP1;                     /*!< (@ 0x0000001C) WCNTCMP1                                                   */
  __IOM uint32_t  WCNTCMP2;                     /*!< (@ 0x00000020) WCNTCMP2                                                   */
  __OM  uint32_t  CMD;                          /*!< (@ 0x00000024) CMD                                                        */
  __IOM uint32_t  WHITECTRL;                    /*!< (@ 0x00000028) WHITECTRL                                                  */
  __IOM uint32_t  WHITEPOLY;                    /*!< (@ 0x0000002C) WHITEPOLY                                                  */
  __IOM uint32_t  WHITEINIT;                    /*!< (@ 0x00000030) WHITEINIT                                                  */
  __IOM uint32_t  FECCTRL;                      /*!< (@ 0x00000034) FECCTRL                                                    */
  __IOM uint32_t  BLOCKRAMADDR;                 /*!< (@ 0x00000038) BLOCKRAMADDR                                               */
  __IOM uint32_t  CONVRAMADDR;                  /*!< (@ 0x0000003C) CONVRAMADDR                                                */
  __IOM uint32_t  CTRL;                         /*!< (@ 0x00000040) CTRL                                                       */
  __IOM uint32_t  RXCTRL;                       /*!< (@ 0x00000044) RXCTRL                                                     */
  __IOM uint32_t  TRAILTXDATACTRL;              /*!< (@ 0x00000048) TRAILTXDATACTRL                                            */
  __IOM uint32_t  TRAILRXDATA;                  /*!< (@ 0x0000004C) TRAILRXDATA                                                */
  __IM  uint32_t  SCNT;                         /*!< (@ 0x00000050) SCNT                                                       */
  __IOM uint32_t  CONVGENERATOR;                /*!< (@ 0x00000054) CONVGENERATOR                                              */
  __IOM uint32_t  PUNCTCTRL;                    /*!< (@ 0x00000058) PUNCTCTRL                                                  */
  __IOM uint32_t  PAUSECTRL;                    /*!< (@ 0x0000005C) PAUSECTRL                                                  */
  __IM  uint32_t  IF;                           /*!< (@ 0x00000060) IF                                                         */
  __OM  uint32_t  IFS;                          /*!< (@ 0x00000064) IFS                                                        */
  __OM  uint32_t  IFC;                          /*!< (@ 0x00000068) IFC                                                        */
  __IOM uint32_t  IEN;                          /*!< (@ 0x0000006C) IEN                                                        */
  __IOM uint32_t  BUFFERMODE;                   /*!< (@ 0x00000070) BUFFERMODE                                                 */
  __IOM uint32_t  ROUTEPEN;                     /*!< (@ 0x00000074) ROUTEPEN                                                   */
  __IOM uint32_t  ROUTELOC0;                    /*!< (@ 0x00000078) ROUTELOC0                                                  */
  __IOM uint32_t  SNIFFCTRL;                    /*!< (@ 0x0000007C) SNIFFCTRL                                                  */
  __IOM uint32_t  AUXDATA;                      /*!< (@ 0x00000080) AUXDATA                                                    */
  __IOM uint32_t  RAWCTRL;                      /*!< (@ 0x00000084) RAWCTRL                                                    */
  __IM  uint32_t  RXRAWDATA;                    /*!< (@ 0x00000088) RXRAWDATA                                                  */
  __IM  uint32_t  PAUSEDATA;                    /*!< (@ 0x0000008C) PAUSEDATA                                                  */
  __IM  uint32_t  LIKELYCONVSTATE;              /*!< (@ 0x00000090) LIKELYCONVSTATE                                            */
  __IM  uint32_t  INTELEMENTNEXT;               /*!< (@ 0x00000094) INTELEMENTNEXT                                             */
  __IOM uint32_t  INTWRITEPOINT;                /*!< (@ 0x00000098) INTWRITEPOINT                                              */
  __IOM uint32_t  INTREADPOINT;                 /*!< (@ 0x0000009C) INTREADPOINT                                               */
  __IOM uint32_t  FCD0;                         /*!< (@ 0x000000A0) FCD0                                                       */
  __IOM uint32_t  FCD1;                         /*!< (@ 0x000000A4) FCD1                                                       */
  __IOM uint32_t  FCD2;                         /*!< (@ 0x000000A8) FCD2                                                       */
  __IOM uint32_t  FCD3;                         /*!< (@ 0x000000AC) FCD3                                                       */
  __IM  uint32_t  RESERVED[4];
  __IM  uint32_t  INTELEMENT0;                  /*!< (@ 0x000000C0) INTELEMENT0                                                */
  __IM  uint32_t  INTELEMENT1;                  /*!< (@ 0x000000C4) INTELEMENT1                                                */
  __IM  uint32_t  INTELEMENT2;                  /*!< (@ 0x000000C8) INTELEMENT2                                                */
  __IM  uint32_t  INTELEMENT3;                  /*!< (@ 0x000000CC) INTELEMENT3                                                */
  __IM  uint32_t  INTELEMENT4;                  /*!< (@ 0x000000D0) INTELEMENT4                                                */
  __IM  uint32_t  INTELEMENT5;                  /*!< (@ 0x000000D4) INTELEMENT5                                                */
  __IM  uint32_t  INTELEMENT6;                  /*!< (@ 0x000000D8) INTELEMENT6                                                */
  __IM  uint32_t  INTELEMENT7;                  /*!< (@ 0x000000DC) INTELEMENT7                                                */
  __IM  uint32_t  INTELEMENT8;                  /*!< (@ 0x000000E0) INTELEMENT8                                                */
  __IM  uint32_t  INTELEMENT9;                  /*!< (@ 0x000000E4) INTELEMENT9                                                */
  __IM  uint32_t  INTELEMENT10;                 /*!< (@ 0x000000E8) INTELEMENT10                                               */
  __IM  uint32_t  INTELEMENT11;                 /*!< (@ 0x000000EC) INTELEMENT11                                               */
  __IM  uint32_t  INTELEMENT12;                 /*!< (@ 0x000000F0) INTELEMENT12                                               */
  __IM  uint32_t  INTELEMENT13;                 /*!< (@ 0x000000F4) INTELEMENT13                                               */
  __IM  uint32_t  INTELEMENT14;                 /*!< (@ 0x000000F8) INTELEMENT14                                               */
  __IM  uint32_t  INTELEMENT15;                 /*!< (@ 0x000000FC) INTELEMENT15                                               */
} FRC_Typedef;                                     /*!< Size = 256 (0x100)                                                        */

/* =========================================================================================================================== */
/* ================                                            FRC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  STATUS  ========================================================= */
#define FRC_STATUS_ACTIVETXFCD_Pos        (0UL)                     /*!< ACTIVETXFCD (Bit 0)                                   */
#define FRC_STATUS_ACTIVETXFCD_Msk        (0x1UL)                   /*!< ACTIVETXFCD (Bitfield-Mask: 0x01)                     */
#define FRC_STATUS_ACTIVERXFCD_Pos        (1UL)                     /*!< ACTIVERXFCD (Bit 1)                                   */
#define FRC_STATUS_ACTIVERXFCD_Msk        (0x2UL)                   /*!< ACTIVERXFCD (Bitfield-Mask: 0x01)                     */
#define FRC_STATUS_RXABORTINPROGRESS_Pos  (2UL)                     /*!< RXABORTINPROGRESS (Bit 2)                             */
#define FRC_STATUS_RXABORTINPROGRESS_Msk  (0x4UL)                   /*!< RXABORTINPROGRESS (Bitfield-Mask: 0x01)               */
#define FRC_STATUS_SNIFFDFRAME_Pos        (3UL)                     /*!< SNIFFDFRAME (Bit 3)                                   */
#define FRC_STATUS_SNIFFDFRAME_Msk        (0x8UL)                   /*!< SNIFFDFRAME (Bitfield-Mask: 0x01)                     */
#define FRC_STATUS_SNIFFDCOUNT_Pos        (4UL)                     /*!< SNIFFDCOUNT (Bit 4)                                   */
#define FRC_STATUS_SNIFFDCOUNT_Msk        (0xf0UL)                  /*!< SNIFFDCOUNT (Bitfield-Mask: 0x0f)                     */
#define FRC_STATUS_RXRAWBLOCKED_Pos       (8UL)                     /*!< RXRAWBLOCKED (Bit 8)                                  */
#define FRC_STATUS_RXRAWBLOCKED_Msk       (0x100UL)                 /*!< RXRAWBLOCKED (Bitfield-Mask: 0x01)                    */
/* ========================================================  DFLCTRL  ======================================================== */
#define FRC_DFLCTRL_DFLMODE_Pos           (0UL)                     /*!< DFLMODE (Bit 0)                                       */
#define FRC_DFLCTRL_DFLMODE_Msk           (0x7UL)                   /*!< DFLMODE (Bitfield-Mask: 0x07)                         */
#define FRC_DFLCTRL_DFLBITORDER_Pos       (3UL)                     /*!< DFLBITORDER (Bit 3)                                   */
#define FRC_DFLCTRL_DFLBITORDER_Msk       (0x8UL)                   /*!< DFLBITORDER (Bitfield-Mask: 0x01)                     */
#define FRC_DFLCTRL_DFLSHIFT_Pos          (4UL)                     /*!< DFLSHIFT (Bit 4)                                      */
#define FRC_DFLCTRL_DFLSHIFT_Msk          (0x70UL)                  /*!< DFLSHIFT (Bitfield-Mask: 0x07)                        */
#define FRC_DFLCTRL_DFLOFFSET_Pos         (8UL)                     /*!< DFLOFFSET (Bit 8)                                     */
#define FRC_DFLCTRL_DFLOFFSET_Msk         (0xf00UL)                 /*!< DFLOFFSET (Bitfield-Mask: 0x0f)                       */
#define FRC_DFLCTRL_DFLBITS_Pos           (12UL)                    /*!< DFLBITS (Bit 12)                                      */
#define FRC_DFLCTRL_DFLBITS_Msk           (0xf000UL)                /*!< DFLBITS (Bitfield-Mask: 0x0f)                         */
#define FRC_DFLCTRL_MINLENGTH_Pos         (16UL)                    /*!< MINLENGTH (Bit 16)                                    */
#define FRC_DFLCTRL_MINLENGTH_Msk         (0xf0000UL)               /*!< MINLENGTH (Bitfield-Mask: 0x0f)                       */
#define FRC_DFLCTRL_DFLINCLUDECRC_Pos     (20UL)                    /*!< DFLINCLUDECRC (Bit 20)                                */
#define FRC_DFLCTRL_DFLINCLUDECRC_Msk     (0x100000UL)              /*!< DFLINCLUDECRC (Bitfield-Mask: 0x01)                   */

#define _FRC_DFLCTRL_DFLMODE_DEFAULT                       0x00000000UL                                 /**< Mode DEFAULT for FRC_DFLCTRL                */
#define _FRC_DFLCTRL_DFLMODE_DISABLE                       0x00000000UL                                 /**< Mode DISABLE for FRC_DFLCTRL                */
#define _FRC_DFLCTRL_DFLMODE_SINGLEBYTE                    0x00000001UL                                 /**< Mode SINGLEBYTE for FRC_DFLCTRL             */
#define _FRC_DFLCTRL_DFLMODE_SINGLEBYTEMSB                 0x00000002UL                                 /**< Mode SINGLEBYTEMSB for FRC_DFLCTRL          */
#define _FRC_DFLCTRL_DFLMODE_DUALBYTELSBFIRST              0x00000003UL                                 /**< Mode DUALBYTELSBFIRST for FRC_DFLCTRL       */
#define _FRC_DFLCTRL_DFLMODE_DUALBYTEMSBFIRST              0x00000004UL                                 /**< Mode DUALBYTEMSBFIRST for FRC_DFLCTRL       */
#define _FRC_DFLCTRL_DFLMODE_INFINITE                      0x00000005UL                                 /**< Mode INFINITE for FRC_DFLCTRL               */
#define _FRC_DFLCTRL_DFLMODE_BLOCKERROR                    0x00000006UL   

