VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_frc.h
/* =======================================================  MAXLENGTH  ======================================================= */
#define FRC_MAXLENGTH_MAXLENGTH_Pos       (0UL)                     /*!< MAXLENGTH (Bit 0)                                     */
#define FRC_MAXLENGTH_MAXLENGTH_Msk       (0xfffUL)                 /*!< MAXLENGTH (Bitfield-Mask: 0xfff)                      */
/* =====================================================  ADDRFILTCTRL  ====================================================== */
#define FRC_ADDRFILTCTRL_EN_Pos           (0UL)                     /*!< EN (Bit 0)                                            */
#define FRC_ADDRFILTCTRL_EN_Msk           (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
#define FRC_ADDRFILTCTRL_BRDCST00EN_Pos   (1UL)                     /*!< BRDCST00EN (Bit 1)                                    */
#define FRC_ADDRFILTCTRL_BRDCST00EN_Msk   (0x2UL)                   /*!< BRDCST00EN (Bitfield-Mask: 0x01)                      */
#define FRC_ADDRFILTCTRL_BRDCSTFFEN_Pos   (2UL)                     /*!< BRDCSTFFEN (Bit 2)                                    */
#define FRC_ADDRFILTCTRL_BRDCSTFFEN_Msk   (0x4UL)                   /*!< BRDCSTFFEN (Bitfield-Mask: 0x01)                      */
#define FRC_ADDRFILTCTRL_ADDRESS_Pos      (8UL)                     /*!< ADDRESS (Bit 8)                                       */
#define FRC_ADDRFILTCTRL_ADDRESS_Msk      (0xff00UL)                /*!< ADDRESS (Bitfield-Mask: 0xff)                         */
/* ======================================================  DATABUFFER  ======================================================= */
#define FRC_DATABUFFER_DATABUFFER_Pos     (0UL)                     /*!< DATABUFFER (Bit 0)                                    */
#define FRC_DATABUFFER_DATABUFFER_Msk     (0xffUL)                  /*!< DATABUFFER (Bitfield-Mask: 0xff)                      */
/* =========================================================  WCNT  ========================================================== */
#define FRC_WCNT_WCNT_Pos                 (0UL)                     /*!< WCNT (Bit 0)                                          */
#define FRC_WCNT_WCNT_Msk                 (0xfffUL)                 /*!< WCNT (Bitfield-Mask: 0xfff)                           */
/* =======================================================  WCNTCMP0  ======================================================== */
#define FRC_WCNTCMP0_FRAMELENGTH_Pos      (0UL)                     /*!< FRAMELENGTH (Bit 0)                                   */
#define FRC_WCNTCMP0_FRAMELENGTH_Msk      (0xfffUL)                 /*!< FRAMELENGTH (Bitfield-Mask: 0xfff)                    */
/* =======================================================  WCNTCMP1  ======================================================== */
#define FRC_WCNTCMP1_LENGTHFIELDLOC_Pos   (0UL)                     /*!< LENGTHFIELDLOC (Bit 0)                                */
#define FRC_WCNTCMP1_LENGTHFIELDLOC_Msk   (0xfffUL)                 /*!< LENGTHFIELDLOC (Bitfield-Mask: 0xfff)                 */
/* =======================================================  WCNTCMP2  ======================================================== */
#define FRC_WCNTCMP2_ADDRFIELDLOC_Pos     (0UL)                     /*!< ADDRFIELDLOC (Bit 0)                                  */
#define FRC_WCNTCMP2_ADDRFIELDLOC_Msk     (0xfffUL)                 /*!< ADDRFIELDLOC (Bitfield-Mask: 0xfff)                   */
/* ==========================================================  CMD  ========================================================== */
#define FRC_CMD_RXABORT_Pos               (0UL)                     /*!< RXABORT (Bit 0)                                       */
#define FRC_CMD_RXABORT_Msk               (0x1UL)                   /*!< RXABORT (Bitfield-Mask: 0x01)                         */
#define FRC_CMD_FRAMEDETRESUME_Pos        (1UL)                     /*!< FRAMEDETRESUME (Bit 1)                                */
#define FRC_CMD_FRAMEDETRESUME_Msk        (0x2UL)                   /*!< FRAMEDETRESUME (Bitfield-Mask: 0x01)                  */
#define FRC_CMD_INTERLEAVEWRITERESUME_Pos (2UL)                     /*!< INTERLEAVEWRITERESUME (Bit 2)                         */
#define FRC_CMD_INTERLEAVEWRITERESUME_Msk (0x4UL)                   /*!< INTERLEAVEWRITERESUME (Bitfield-Mask: 0x01)           */
#define FRC_CMD_INTERLEAVEREADRESUME_Pos  (3UL)                     /*!< INTERLEAVEREADRESUME (Bit 3)                          */
#define FRC_CMD_INTERLEAVEREADRESUME_Msk  (0x8UL)                   /*!< INTERLEAVEREADRESUME (Bitfield-Mask: 0x01)            */
#define FRC_CMD_CONVRESUME_Pos            (4UL)                     /*!< CONVRESUME (Bit 4)                                    */
#define FRC_CMD_CONVRESUME_Msk            (0x10UL)                  /*!< CONVRESUME (Bitfield-Mask: 0x01)                      */
#define FRC_CMD_CONVTERMINATE_Pos         (5UL)                     /*!< CONVTERMINATE (Bit 5)                                 */
#define FRC_CMD_CONVTERMINATE_Msk         (0x20UL)                  /*!< CONVTERMINATE (Bitfield-Mask: 0x01)                   */
#define FRC_CMD_TXSUBFRAMERESUME_Pos      (6UL)                     /*!< TXSUBFRAMERESUME (Bit 6)                              */
#define FRC_CMD_TXSUBFRAMERESUME_Msk      (0x40UL)                  /*!< TXSUBFRAMERESUME (Bitfield-Mask: 0x01)                */
#define FRC_CMD_INTERLEAVEINIT_Pos        (7UL)                     /*!< INTERLEAVEINIT (Bit 7)                                */
#define FRC_CMD_INTERLEAVEINIT_Msk        (0x80UL)                  /*!< INTERLEAVEINIT (Bitfield-Mask: 0x01)                  */
#define FRC_CMD_INTERLEAVECNTCLEAR_Pos    (8UL)                     /*!< INTERLEAVECNTCLEAR (Bit 8)                            */
#define FRC_CMD_INTERLEAVECNTCLEAR_Msk    (0x100UL)                 /*!< INTERLEAVECNTCLEAR (Bitfield-Mask: 0x01)              */
#define FRC_CMD_CONVINIT_Pos              (9UL)                     /*!< CONVINIT (Bit 9)                                      */
#define FRC_CMD_CONVINIT_Msk              (0x200UL)                 /*!< CONVINIT (Bitfield-Mask: 0x01)                        */
#define FRC_CMD_BLOCKINIT_Pos             (10UL)                    /*!< BLOCKINIT (Bit 10)                                    */
#define FRC_CMD_BLOCKINIT_Msk             (0x400UL)                 /*!< BLOCKINIT (Bitfield-Mask: 0x01)                       */
#define FRC_CMD_STATEINIT_Pos             (11UL)                    /*!< STATEINIT (Bit 11)                                    */
#define FRC_CMD_STATEINIT_Msk             (0x800UL)                 /*!< STATEINIT (Bitfield-Mask: 0x01)                       */
#define FRC_CMD_RXRAWUNBLOCK_Pos          (12UL)                    /*!< RXRAWUNBLOCK (Bit 12)                                 */
#define FRC_CMD_RXRAWUNBLOCK_Msk          (0x1000UL)                /*!< RXRAWUNBLOCK (Bitfield-Mask: 0x01)                    */
/* =======================================================  WHITECTRL  ======================================================= */
#define FRC_WHITECTRL_FEEDBACKSEL_Pos     (0UL)                     /*!< FEEDBACKSEL (Bit 0)                                   */
#define FRC_WHITECTRL_FEEDBACKSEL_Msk     (0x1fUL)                  /*!< FEEDBACKSEL (Bitfield-Mask: 0x1f)                     */
#define FRC_WHITECTRL_XORFEEDBACK_Pos     (5UL)                     /*!< XORFEEDBACK (Bit 5)                                   */
#define FRC_WHITECTRL_XORFEEDBACK_Msk     (0x60UL)                  /*!< XORFEEDBACK (Bitfield-Mask: 0x03)                     */
#define FRC_WHITECTRL_SHROUTPUTSEL_Pos    (8UL)                     /*!< SHROUTPUTSEL (Bit 8)                                  */
#define FRC_WHITECTRL_SHROUTPUTSEL_Msk    (0xf00UL)                 /*!< SHROUTPUTSEL (Bitfield-Mask: 0x0f)                    */
#define FRC_WHITECTRL_BLOCKERRORCORRECT_Pos (12UL)                  /*!< BLOCKERRORCORRECT (Bit 12)                            */
#define FRC_WHITECTRL_BLOCKERRORCORRECT_Msk (0x1000UL)              /*!< BLOCKERRORCORRECT (Bitfield-Mask: 0x01)               */
/* =======================================================  WHITEPOLY  ======================================================= */
#define FRC_WHITEPOLY_POLY_Pos            (0UL)                     /*!< POLY (Bit 0)                                          */
#define FRC_WHITEPOLY_POLY_Msk            (0xffffUL)                /*!< POLY (Bitfield-Mask: 0xffff)                          */
/* =======================================================  WHITEINIT  ======================================================= */
#define FRC_WHITEINIT_WHITEINIT_Pos       (0UL)                     /*!< WHITEINIT (Bit 0)                                     */
#define FRC_WHITEINIT_WHITEINIT_Msk       (0xffffUL)                /*!< WHITEINIT (Bitfield-Mask: 0xffff)                     */
/* ========================================================  FECCTRL  ======================================================== */
#define FRC_FECCTRL_BLOCKWHITEMODE_Pos    (0UL)                     /*!< BLOCKWHITEMODE (Bit 0)                                */
#define FRC_FECCTRL_BLOCKWHITEMODE_Msk    (0x7UL)                   /*!< BLOCKWHITEMODE (Bitfield-Mask: 0x07)                  */
#define FRC_FECCTRL_CONVMODE_Pos          (4UL)                     /*!< CONVMODE (Bit 4)                                      */
#define FRC_FECCTRL_CONVMODE_Msk          (0x30UL)                  /*!< CONVMODE (Bitfield-Mask: 0x03)                        */
#define FRC_FECCTRL_CONVDECODEMODE_Pos    (6UL)                     /*!< CONVDECODEMODE (Bit 6)                                */
#define FRC_FECCTRL_CONVDECODEMODE_Msk    (0x40UL)                  /*!< CONVDECODEMODE (Bitfield-Mask: 0x01)                  */
#define FRC_FECCTRL_CONVTRACEBACKDISABLE_Pos (7UL)                  /*!< CONVTRACEBACKDISABLE (Bit 7)                          */
#define FRC_FECCTRL_CONVTRACEBACKDISABLE_Msk (0x80UL)               /*!< CONVTRACEBACKDISABLE (Bitfield-Mask: 0x01)            */
#define FRC_FECCTRL_CONVINV_Pos           (8UL)                     /*!< CONVINV (Bit 8)                                       */
#define FRC_FECCTRL_CONVINV_Msk           (0x300UL)                 /*!< CONVINV (Bitfield-Mask: 0x03)                         */
#define FRC_FECCTRL_INTERLEAVEMODE_Pos    (10UL)                    /*!< INTERLEAVEMODE (Bit 10)                               */
#define FRC_FECCTRL_INTERLEAVEMODE_Msk    (0xc00UL)                 /*!< INTERLEAVEMODE (Bitfield-Mask: 0x03)                  */
#define FRC_FECCTRL_INTERLEAVEFIRSTINDEX_Pos (12UL)                 /*!< INTERLEAVEFIRSTINDEX (Bit 12)                         */
#define FRC_FECCTRL_INTERLEAVEFIRSTINDEX_Msk (0xf000UL)             /*!< INTERLEAVEFIRSTINDEX (Bitfield-Mask: 0x0f)            */
#define FRC_FECCTRL_INTERLEAVEWIDTH_Pos   (16UL)                    /*!< INTERLEAVEWIDTH (Bit 16)                              */
#define FRC_FECCTRL_INTERLEAVEWIDTH_Msk   (0x10000UL)               /*!< INTERLEAVEWIDTH (Bitfield-Mask: 0x01)                 */
#define FRC_FECCTRL_CONVBUSLOCK_Pos       (17UL)                    /*!< CONVBUSLOCK (Bit 17)                                  */
#define FRC_FECCTRL_CONVBUSLOCK_Msk       (0x20000UL)               /*!< CONVBUSLOCK (Bitfield-Mask: 0x01)                     */
#define FRC_FECCTRL_CONVSUBFRAMETERMINATE_Pos (18UL)                /*!< CONVSUBFRAMETERMINATE (Bit 18)                        */
#define FRC_FECCTRL_CONVSUBFRAMETERMINATE_Msk (0x40000UL)           /*!< CONVSUBFRAMETERMINATE (Bitfield-Mask: 0x01)           */
#define FRC_FECCTRL_SINGLEBLOCK_Pos       (19UL)                    /*!< SINGLEBLOCK (Bit 19)                                  */
#define FRC_FECCTRL_SINGLEBLOCK_Msk       (0x80000UL)               /*!< SINGLEBLOCK (Bitfield-Mask: 0x01)                     */
#define FRC_FECCTRL_FORCE2FSK_Pos         (20UL)                    /*!< FORCE2FSK (Bit 20)                                    */
#define FRC_FECCTRL_FORCE2FSK_Msk         (0x100000UL)              /*!< FORCE2FSK (Bitfield-Mask: 0x01)                       */
#define FRC_FECCTRL_CONVHARDERROR_Pos     (21UL)                    /*!< CONVHARDERROR (Bit 21)                                */
#define FRC_FECCTRL_CONVHARDERROR_Msk     (0x200000UL)              /*!< CONVHARDERROR (Bitfield-Mask: 0x01)                   */
/* =====================================================  BLOCKRAMADDR  ====================================================== */
#define FRC_BLOCKRAMADDR_BLOCKRAMADDR_Pos (2UL)                     /*!< BLOCKRAMADDR (Bit 2)                                  */
#define FRC_BLOCKRAMADDR_BLOCKRAMADDR_Msk (0x7ffcUL)                /*!< BLOCKRAMADDR (Bitfield-Mask: 0x1fff)                  */
/* ======================================================  CONVRAMADDR  ====================================================== */
#define FRC_CONVRAMADDR_CONVRAMADDR_Pos   (2UL)                     /*!< CONVRAMADDR (Bit 2)                                   */
#define FRC_CONVRAMADDR_CONVRAMADDR_Msk   (0x7ffcUL)                /*!< CONVRAMADDR (Bitfield-Mask: 0x1fff)                   */
/* =========================================================  CTRL  ========================================================== */
#define FRC_CTRL_RANDOMTX_Pos             (0UL)                     /*!< RANDOMTX (Bit 0)                                      */
#define FRC_CTRL_RANDOMTX_Msk             (0x1UL)                   /*!< RANDOMTX (Bitfield-Mask: 0x01)                        */
#define FRC_CTRL_UARTMODE_Pos             (1UL)                     /*!< UARTMODE (Bit 1)                                      */
#define FRC_CTRL_UARTMODE_Msk             (0x2UL)                   /*!< UARTMODE (Bitfield-Mask: 0x01)                        */
#define FRC_CTRL_BITORDER_Pos             (2UL)                     /*!< BITORDER (Bit 2)                                      */
#define FRC_CTRL_BITORDER_Msk             (0x4UL)                   /*!< BITORDER (Bitfield-Mask: 0x01)                        */
#define FRC_CTRL_TXFCDMODE_Pos            (4UL)                     /*!< TXFCDMODE (Bit 4)                                     */
#define FRC_CTRL_TXFCDMODE_Msk            (0x30UL)                  /*!< TXFCDMODE (Bitfield-Mask: 0x03)                       */
#define FRC_CTRL_RXFCDMODE_Pos            (6UL)                     /*!< RXFCDMODE (Bit 6)                                     */
#define FRC_CTRL_RXFCDMODE_Msk            (0xc0UL)                  /*!< RXFCDMODE (Bitfield-Mask: 0x03)                       */
#define FRC_CTRL_BITSPERWORD_Pos          (8UL)                     /*!< BITSPERWORD (Bit 8)                                   */
#define FRC_CTRL_BITSPERWORD_Msk          (0x700UL)                 /*!< BITSPERWORD (Bitfield-Mask: 0x07)                     */
#define FRC_CTRL_RATESELECT_Pos           (11UL)                    /*!< RATESELECT (Bit 11)                                   */
#define FRC_CTRL_RATESELECT_Msk           (0x1800UL)                /*!< RATESELECT (Bitfield-Mask: 0x03)                      */
#define FRC_CTRL_TXPREFETCH_Pos           (13UL)                    /*!< TXPREFETCH (Bit 13)                                   */
#define FRC_CTRL_TXPREFETCH_Msk           (0x2000UL)                /*!< TXPREFETCH (Bitfield-Mask: 0x01)                      */
#define FRC_CTRL_SEQHANDSHAKE_Pos         (16UL)                    /*!< SEQHANDSHAKE (Bit 16)                                 */
#define FRC_CTRL_SEQHANDSHAKE_Msk         (0x10000UL)               /*!< SEQHANDSHAKE (Bitfield-Mask: 0x01)                    */
#define FRC_CTRL_PRBSTEST_Pos             (17UL)                    /*!< PRBSTEST (Bit 17)                                     */
#define FRC_CTRL_PRBSTEST_Msk             (0x20000UL)               /*!< PRBSTEST (Bitfield-Mask: 0x01)                        */
/* ========================================================  RXCTRL  ========================================================= */
#define FRC_RXCTRL_STORECRC_Pos           (0UL)                     /*!< STORECRC (Bit 0)                                      */
#define FRC_RXCTRL_STORECRC_Msk           (0x1UL)                   /*!< STORECRC (Bitfield-Mask: 0x01)                        */
#define FRC_RXCTRL_ACCEPTCRCERRORS_Pos    (1UL)                     /*!< ACCEPTCRCERRORS (Bit 1)                               */
#define FRC_RXCTRL_ACCEPTCRCERRORS_Msk    (0x2UL)                   /*!< ACCEPTCRCERRORS (Bitfield-Mask: 0x01)                 */
#define FRC_RXCTRL_ACCEPTBLOCKERRORS_Pos  (2UL)                     /*!< ACCEPTBLOCKERRORS (Bit 2)                             */
#define FRC_RXCTRL_ACCEPTBLOCKERRORS_Msk  (0x4UL)                   /*!< ACCEPTBLOCKERRORS (Bitfield-Mask: 0x01)               */
#define FRC_RXCTRL_TRACKABFRAME_Pos       (3UL)                     /*!< TRACKABFRAME (Bit 3)                                  */
#define FRC_RXCTRL_TRACKABFRAME_Msk       (0x8UL)                   /*!< TRACKABFRAME (Bitfield-Mask: 0x01)                    */
#define FRC_RXCTRL_BUFCLEAR_Pos           (4UL)                     /*!< BUFCLEAR (Bit 4)                                      */
#define FRC_RXCTRL_BUFCLEAR_Msk           (0x10UL)                  /*!< BUFCLEAR (Bitfield-Mask: 0x01)                        */
#define FRC_RXCTRL_BUFRESTOREFRAMEERROR_Pos (5UL)                   /*!< BUFRESTOREFRAMEERROR (Bit 5)                          */
#define FRC_RXCTRL_BUFRESTOREFRAMEERROR_Msk (0x20UL)                /*!< BUFRESTOREFRAMEERROR (Bitfield-Mask: 0x01)            */
#define FRC_RXCTRL_BUFRESTORERXABORTED_Pos (6UL)                    /*!< BUFRESTORERXABORTED (Bit 6)                           */
#define FRC_RXCTRL_BUFRESTORERXABORTED_Msk (0x40UL)                 /*!< BUFRESTORERXABORTED (Bitfield-Mask: 0x01)             */
/* ====================================================  TRAILTXDATACTRL  ==================================================== */
#define FRC_TRAILTXDATACTRL_TRAILTXDATA_Pos (0UL)                   /*!< TRAILTXDATA (Bit 0)                                   */
#define FRC_TRAILTXDATACTRL_TRAILTXDATA_Msk (0xffUL)                /*!< TRAILTXDATA (Bitfield-Mask: 0xff)                     */
#define FRC_TRAILTXDATACTRL_TRAILTXDATACNT_Pos (8UL)                /*!< TRAILTXDATACNT (Bit 8)                                */
#define FRC_TRAILTXDATACTRL_TRAILTXDATACNT_Msk (0x700UL)            /*!< TRAILTXDATACNT (Bitfield-Mask: 0x07)                  */
#define FRC_TRAILTXDATACTRL_TRAILTXDATAFORCE_Pos (11UL)             /*!< TRAILTXDATAFORCE (Bit 11)                             */
#define FRC_TRAILTXDATACTRL_TRAILTXDATAFORCE_Msk (0x800UL)          /*!< TRAILTXDATAFORCE (Bitfield-Mask: 0x01)                */
/* ======================================================  TRAILRXDATA  ====================================================== */
#define FRC_TRAILRXDATA_RSSI_Pos          (0UL)                     /*!< RSSI (Bit 0)                                          */
#define FRC_TRAILRXDATA_RSSI_Msk          (0x1UL)                   /*!< RSSI (Bitfield-Mask: 0x01)                            */
#define FRC_TRAILRXDATA_CRCOK_Pos         (1UL)                     /*!< CRCOK (Bit 1)                                         */
#define FRC_TRAILRXDATA_CRCOK_Msk         (0x2UL)                   /*!< CRCOK (Bitfield-Mask: 0x01)                           */
#define FRC_TRAILRXDATA_PROTIMERCC0BASE_Pos (2UL)                   /*!< PROTIMERCC0BASE (Bit 2)                               */
#define FRC_TRAILRXDATA_PROTIMERCC0BASE_Msk (0x4UL)                 /*!< PROTIMERCC0BASE (Bitfield-Mask: 0x01)                 */
#define FRC_TRAILRXDATA_PROTIMERCC0WRAPL_Pos (3UL)                  /*!< PROTIMERCC0WRAPL (Bit 3)                              */
#define FRC_TRAILRXDATA_PROTIMERCC0WRAPL_Msk (0x8UL)                /*!< PROTIMERCC0WRAPL (Bitfield-Mask: 0x01)                */
#define FRC_TRAILRXDATA_PROTIMERCC0WRAPH_Pos (4UL)                  /*!< PROTIMERCC0WRAPH (Bit 4)                              */
#define FRC_TRAILRXDATA_PROTIMERCC0WRAPH_Msk (0x10UL)               /*!< PROTIMERCC0WRAPH (Bitfield-Mask: 0x01)                */
#define FRC_TRAILRXDATA_RTCSTAMP_Pos      (5UL)                     /*!< RTCSTAMP (Bit 5)                                      */
#define FRC_TRAILRXDATA_RTCSTAMP_Msk      (0x20UL)                  /*!< RTCSTAMP (Bitfield-Mask: 0x01)                        */
/* =========================================================  SCNT  ========================================================== */
#define FRC_SCNT_SCNT_Pos                 (0UL)                     /*!< SCNT (Bit 0)                                          */
#define FRC_SCNT_SCNT_Msk                 (0xffUL)                  /*!< SCNT (Bitfield-Mask: 0xff)                            */
/* =====================================================  CONVGENERATOR  ===================================================== */
#define FRC_CONVGENERATOR_GENERATOR0_Pos  (0UL)                     /*!< GENERATOR0 (Bit 0)                                    */
#define FRC_CONVGENERATOR_GENERATOR0_Msk  (0x7fUL)                  /*!< GENERATOR0 (Bitfield-Mask: 0x7f)                      */
#define FRC_CONVGENERATOR_GENERATOR1_Pos  (8UL)                     /*!< GENERATOR1 (Bit 8)                                    */
#define FRC_CONVGENERATOR_GENERATOR1_Msk  (0x7f00UL)                /*!< GENERATOR1 (Bitfield-Mask: 0x7f)                      */
#define FRC_CONVGENERATOR_RECURSIVE_Pos   (16UL)                    /*!< RECURSIVE (Bit 16)                                    */
#define FRC_CONVGENERATOR_RECURSIVE_Msk   (0x10000UL)               /*!< RECURSIVE (Bitfield-Mask: 0x01)                       */
#define FRC_CONVGENERATOR_NONSYSTEMATIC_Pos (17UL)                  /*!< NONSYSTEMATIC (Bit 17)                                */
#define FRC_CONVGENERATOR_NONSYSTEMATIC_Msk (0x20000UL)             /*!< NONSYSTEMATIC (Bitfield-Mask: 0x01)                   */
/* =======================================================  PUNCTCTRL  ======================================================= */
#define FRC_PUNCTCTRL_PUNCT0_Pos          (0UL)                     /*!< PUNCT0 (Bit 0)                                        */
#define FRC_PUNCTCTRL_PUNCT0_Msk          (0x7fUL)                  /*!< PUNCT0 (Bitfield-Mask: 0x7f)                          */
#define FRC_PUNCTCTRL_PUNCT1_Pos          (8UL)                     /*!< PUNCT1 (Bit 8)                                        */
#define FRC_PUNCTCTRL_PUNCT1_Msk          (0x7f00UL)                /*!< PUNCT1 (Bitfield-Mask: 0x7f)                          */
/* =======================================================  PAUSECTRL  ======================================================= */
#define FRC_PAUSECTRL_FRAMEDETPAUSEEN_Pos (0UL)                     /*!< FRAMEDETPAUSEEN (Bit 0)                               */
#define FRC_PAUSECTRL_FRAMEDETPAUSEEN_Msk (0x1UL)                   /*!< FRAMEDETPAUSEEN (Bitfield-Mask: 0x01)                 */
#define FRC_PAUSECTRL_TXINTERLEAVEWRITEPAUSEEN_Pos (1UL)            /*!< TXINTERLEAVEWRITEPAUSEEN (Bit 1)                      */
#define FRC_PAUSECTRL_TXINTERLEAVEWRITEPAUSEEN_Msk (0x2UL)          /*!< TXINTERLEAVEWRITEPAUSEEN (Bitfield-Mask: 0x01)        */
#define FRC_PAUSECTRL_RXINTERLEAVEWRITEPAUSEEN_Pos (2UL)            /*!< RXINTERLEAVEWRITEPAUSEEN (Bit 2)                      */
#define FRC_PAUSECTRL_RXINTERLEAVEWRITEPAUSEEN_Msk (0x4UL)          /*!< RXINTERLEAVEWRITEPAUSEEN (Bitfield-Mask: 0x01)        */
#define FRC_PAUSECTRL_INTERLEAVEREADPAUSEEN_Pos (3UL)               /*!< INTERLEAVEREADPAUSEEN (Bit 3)                         */
#define FRC_PAUSECTRL_INTERLEAVEREADPAUSEEN_Msk (0x8UL)             /*!< INTERLEAVEREADPAUSEEN (Bitfield-Mask: 0x01)           */
