VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_frc.h
#define FRC_PAUSECTRL_TXSUBFRAMEPAUSEEN_Pos (4UL)                   /*!< TXSUBFRAMEPAUSEEN (Bit 4)                             */
#define FRC_PAUSECTRL_TXSUBFRAMEPAUSEEN_Msk (0x10UL)                /*!< TXSUBFRAMEPAUSEEN (Bitfield-Mask: 0x01)               */
#define FRC_PAUSECTRL_CONVPAUSECNT_Pos    (5UL)                     /*!< CONVPAUSECNT (Bit 5)                                  */
#define FRC_PAUSECTRL_CONVPAUSECNT_Msk    (0x7e0UL)                 /*!< CONVPAUSECNT (Bitfield-Mask: 0x3f)                    */
#define FRC_PAUSECTRL_INTERLEAVEWRITEPAUSECNT_Pos (11UL)            /*!< INTERLEAVEWRITEPAUSECNT (Bit 11)                      */
#define FRC_PAUSECTRL_INTERLEAVEWRITEPAUSECNT_Msk (0xf800UL)        /*!< INTERLEAVEWRITEPAUSECNT (Bitfield-Mask: 0x1f)         */
#define FRC_PAUSECTRL_INTERLEAVEREADPAUSECNT_Pos (16UL)             /*!< INTERLEAVEREADPAUSECNT (Bit 16)                       */
#define FRC_PAUSECTRL_INTERLEAVEREADPAUSECNT_Msk (0x1f0000UL)       /*!< INTERLEAVEREADPAUSECNT (Bitfield-Mask: 0x1f)          */
/* ==========================================================  IF  =========================================================== */
#define FRC_IF_TXDONE_Pos                 (0UL)                     /*!< TXDONE (Bit 0)                                        */
#define FRC_IF_TXDONE_Msk                 (0x1UL)                   /*!< TXDONE (Bitfield-Mask: 0x01)                          */
#define FRC_IF_TXAFTERFRAMEDONE_Pos       (1UL)                     /*!< TXAFTERFRAMEDONE (Bit 1)                              */
#define FRC_IF_TXAFTERFRAMEDONE_Msk       (0x2UL)                   /*!< TXAFTERFRAMEDONE (Bitfield-Mask: 0x01)                */
#define FRC_IF_TXABORTED_Pos              (2UL)                     /*!< TXABORTED (Bit 2)                                     */
#define FRC_IF_TXABORTED_Msk              (0x4UL)                   /*!< TXABORTED (Bitfield-Mask: 0x01)                       */
#define FRC_IF_TXUF_Pos                   (3UL)                     /*!< TXUF (Bit 3)                                          */
#define FRC_IF_TXUF_Msk                   (0x8UL)                   /*!< TXUF (Bitfield-Mask: 0x01)                            */
#define FRC_IF_RXDONE_Pos                 (4UL)                     /*!< RXDONE (Bit 4)                                        */
#define FRC_IF_RXDONE_Msk                 (0x10UL)                  /*!< RXDONE (Bitfield-Mask: 0x01)                          */
#define FRC_IF_RXABORTED_Pos              (5UL)                     /*!< RXABORTED (Bit 5)                                     */
#define FRC_IF_RXABORTED_Msk              (0x20UL)                  /*!< RXABORTED (Bitfield-Mask: 0x01)                       */
#define FRC_IF_FRAMEERROR_Pos             (6UL)                     /*!< FRAMEERROR (Bit 6)                                    */
#define FRC_IF_FRAMEERROR_Msk             (0x40UL)                  /*!< FRAMEERROR (Bitfield-Mask: 0x01)                      */
#define FRC_IF_BLOCKERROR_Pos             (7UL)                     /*!< BLOCKERROR (Bit 7)                                    */
#define FRC_IF_BLOCKERROR_Msk             (0x80UL)                  /*!< BLOCKERROR (Bitfield-Mask: 0x01)                      */
#define FRC_IF_RXOF_Pos                   (8UL)                     /*!< RXOF (Bit 8)                                          */
#define FRC_IF_RXOF_Msk                   (0x100UL)                 /*!< RXOF (Bitfield-Mask: 0x01)                            */
#define FRC_IF_WCNTCMP0_Pos               (9UL)                     /*!< WCNTCMP0 (Bit 9)                                      */
#define FRC_IF_WCNTCMP0_Msk               (0x200UL)                 /*!< WCNTCMP0 (Bitfield-Mask: 0x01)                        */
#define FRC_IF_WCNTCMP1_Pos               (10UL)                    /*!< WCNTCMP1 (Bit 10)                                     */
#define FRC_IF_WCNTCMP1_Msk               (0x400UL)                 /*!< WCNTCMP1 (Bitfield-Mask: 0x01)                        */
#define FRC_IF_WCNTCMP2_Pos               (11UL)                    /*!< WCNTCMP2 (Bit 11)                                     */
#define FRC_IF_WCNTCMP2_Msk               (0x800UL)                 /*!< WCNTCMP2 (Bitfield-Mask: 0x01)                        */
#define FRC_IF_ADDRERROR_Pos              (12UL)                    /*!< ADDRERROR (Bit 12)                                    */
#define FRC_IF_ADDRERROR_Msk              (0x1000UL)                /*!< ADDRERROR (Bitfield-Mask: 0x01)                       */
#define FRC_IF_BUSERROR_Pos               (13UL)                    /*!< BUSERROR (Bit 13)                                     */
#define FRC_IF_BUSERROR_Msk               (0x2000UL)                /*!< BUSERROR (Bitfield-Mask: 0x01)                        */
#define FRC_IF_RXRAWEVENT_Pos             (14UL)                    /*!< RXRAWEVENT (Bit 14)                                   */
#define FRC_IF_RXRAWEVENT_Msk             (0x4000UL)                /*!< RXRAWEVENT (Bitfield-Mask: 0x01)                      */
#define FRC_IF_TXRAWEVENT_Pos             (15UL)                    /*!< TXRAWEVENT (Bit 15)                                   */
#define FRC_IF_TXRAWEVENT_Msk             (0x8000UL)                /*!< TXRAWEVENT (Bitfield-Mask: 0x01)                      */
#define FRC_IF_SNIFFOF_Pos                (16UL)                    /*!< SNIFFOF (Bit 16)                                      */
#define FRC_IF_SNIFFOF_Msk                (0x10000UL)               /*!< SNIFFOF (Bitfield-Mask: 0x01)                         */
#define FRC_IF_LVDSWILLERROR_Pos          (17UL)                    /*!< LVDSWILLERROR (Bit 17)                                */
#define FRC_IF_LVDSWILLERROR_Msk          (0x20000UL)               /*!< LVDSWILLERROR (Bitfield-Mask: 0x01)                   */
#define FRC_IF_LVDSERROR_Pos              (18UL)                    /*!< LVDSERROR (Bit 18)                                    */
#define FRC_IF_LVDSERROR_Msk              (0x40000UL)               /*!< LVDSERROR (Bitfield-Mask: 0x01)                       */
#define FRC_IF_FRAMEDETPAUSED_Pos         (24UL)                    /*!< FRAMEDETPAUSED (Bit 24)                               */
#define FRC_IF_FRAMEDETPAUSED_Msk         (0x1000000UL)             /*!< FRAMEDETPAUSED (Bitfield-Mask: 0x01)                  */
#define FRC_IF_INTERLEAVEWRITEPAUSED_Pos  (25UL)                    /*!< INTERLEAVEWRITEPAUSED (Bit 25)                        */
#define FRC_IF_INTERLEAVEWRITEPAUSED_Msk  (0x2000000UL)             /*!< INTERLEAVEWRITEPAUSED (Bitfield-Mask: 0x01)           */
#define FRC_IF_INTERLEAVEREADPAUSED_Pos   (26UL)                    /*!< INTERLEAVEREADPAUSED (Bit 26)                         */
#define FRC_IF_INTERLEAVEREADPAUSED_Msk   (0x4000000UL)             /*!< INTERLEAVEREADPAUSED (Bitfield-Mask: 0x01)            */
#define FRC_IF_TXSUBFRAMEPAUSED_Pos       (27UL)                    /*!< TXSUBFRAMEPAUSED (Bit 27)                             */
#define FRC_IF_TXSUBFRAMEPAUSED_Msk       (0x8000000UL)             /*!< TXSUBFRAMEPAUSED (Bitfield-Mask: 0x01)                */
#define FRC_IF_CONVPAUSED_Pos             (28UL)                    /*!< CONVPAUSED (Bit 28)                                   */
#define FRC_IF_CONVPAUSED_Msk             (0x10000000UL)            /*!< CONVPAUSED (Bitfield-Mask: 0x01)                      */
#define FRC_IF_RXWORD_Pos                 (29UL)                    /*!< RXWORD (Bit 29)                                       */
#define FRC_IF_RXWORD_Msk                 (0x20000000UL)            /*!< RXWORD (Bitfield-Mask: 0x01)                          */
#define FRC_IF_TXWORD_Pos                 (30UL)                    /*!< TXWORD (Bit 30)                                       */
#define FRC_IF_TXWORD_Msk                 (0x40000000UL)            /*!< TXWORD (Bitfield-Mask: 0x01)                          */
/* ==========================================================  IFS  ========================================================== */
#define FRC_IFS_TXDONE_Pos                (0UL)                     /*!< TXDONE (Bit 0)                                        */
#define FRC_IFS_TXDONE_Msk                (0x1UL)                   /*!< TXDONE (Bitfield-Mask: 0x01)                          */
#define FRC_IFS_TXAFTERFRAMEDONE_Pos      (1UL)                     /*!< TXAFTERFRAMEDONE (Bit 1)                              */
#define FRC_IFS_TXAFTERFRAMEDONE_Msk      (0x2UL)                   /*!< TXAFTERFRAMEDONE (Bitfield-Mask: 0x01)                */
#define FRC_IFS_TXABORTED_Pos             (2UL)                     /*!< TXABORTED (Bit 2)                                     */
#define FRC_IFS_TXABORTED_Msk             (0x4UL)                   /*!< TXABORTED (Bitfield-Mask: 0x01)                       */
#define FRC_IFS_TXUF_Pos                  (3UL)                     /*!< TXUF (Bit 3)                                          */
#define FRC_IFS_TXUF_Msk                  (0x8UL)                   /*!< TXUF (Bitfield-Mask: 0x01)                            */
#define FRC_IFS_RXDONE_Pos                (4UL)                     /*!< RXDONE (Bit 4)                                        */
#define FRC_IFS_RXDONE_Msk                (0x10UL)                  /*!< RXDONE (Bitfield-Mask: 0x01)                          */
#define FRC_IFS_RXABORTED_Pos             (5UL)                     /*!< RXABORTED (Bit 5)                                     */
#define FRC_IFS_RXABORTED_Msk             (0x20UL)                  /*!< RXABORTED (Bitfield-Mask: 0x01)                       */
#define FRC_IFS_FRAMEERROR_Pos            (6UL)                     /*!< FRAMEERROR (Bit 6)                                    */
#define FRC_IFS_FRAMEERROR_Msk            (0x40UL)                  /*!< FRAMEERROR (Bitfield-Mask: 0x01)                      */
#define FRC_IFS_BLOCKERROR_Pos            (7UL)                     /*!< BLOCKERROR (Bit 7)                                    */
#define FRC_IFS_BLOCKERROR_Msk            (0x80UL)                  /*!< BLOCKERROR (Bitfield-Mask: 0x01)                      */
#define FRC_IFS_RXOF_Pos                  (8UL)                     /*!< RXOF (Bit 8)                                          */
#define FRC_IFS_RXOF_Msk                  (0x100UL)                 /*!< RXOF (Bitfield-Mask: 0x01)                            */
#define FRC_IFS_WCNTCMP0_Pos              (9UL)                     /*!< WCNTCMP0 (Bit 9)                                      */
#define FRC_IFS_WCNTCMP0_Msk              (0x200UL)                 /*!< WCNTCMP0 (Bitfield-Mask: 0x01)                        */
#define FRC_IFS_WCNTCMP1_Pos              (10UL)                    /*!< WCNTCMP1 (Bit 10)                                     */
#define FRC_IFS_WCNTCMP1_Msk              (0x400UL)                 /*!< WCNTCMP1 (Bitfield-Mask: 0x01)                        */
#define FRC_IFS_WCNTCMP2_Pos              (11UL)                    /*!< WCNTCMP2 (Bit 11)                                     */
#define FRC_IFS_WCNTCMP2_Msk              (0x800UL)                 /*!< WCNTCMP2 (Bitfield-Mask: 0x01)                        */
#define FRC_IFS_ADDRERROR_Pos             (12UL)                    /*!< ADDRERROR (Bit 12)                                    */
#define FRC_IFS_ADDRERROR_Msk             (0x1000UL)                /*!< ADDRERROR (Bitfield-Mask: 0x01)                       */
#define FRC_IFS_BUSERROR_Pos              (13UL)                    /*!< BUSERROR (Bit 13)                                     */
#define FRC_IFS_BUSERROR_Msk              (0x2000UL)                /*!< BUSERROR (Bitfield-Mask: 0x01)                        */
#define FRC_IFS_RXRAWEVENT_Pos            (14UL)                    /*!< RXRAWEVENT (Bit 14)                                   */
#define FRC_IFS_RXRAWEVENT_Msk            (0x4000UL)                /*!< RXRAWEVENT (Bitfield-Mask: 0x01)                      */
#define FRC_IFS_TXRAWEVENT_Pos            (15UL)                    /*!< TXRAWEVENT (Bit 15)                                   */
#define FRC_IFS_TXRAWEVENT_Msk            (0x8000UL)                /*!< TXRAWEVENT (Bitfield-Mask: 0x01)                      */
#define FRC_IFS_SNIFFOF_Pos               (16UL)                    /*!< SNIFFOF (Bit 16)                                      */
#define FRC_IFS_SNIFFOF_Msk               (0x10000UL)               /*!< SNIFFOF (Bitfield-Mask: 0x01)                         */
#define FRC_IFS_LVDSWILLERROR_Pos         (17UL)                    /*!< LVDSWILLERROR (Bit 17)                                */
#define FRC_IFS_LVDSWILLERROR_Msk         (0x20000UL)               /*!< LVDSWILLERROR (Bitfield-Mask: 0x01)                   */
#define FRC_IFS_LVDSERROR_Pos             (18UL)                    /*!< LVDSERROR (Bit 18)                                    */
#define FRC_IFS_LVDSERROR_Msk             (0x40000UL)               /*!< LVDSERROR (Bitfield-Mask: 0x01)                       */
/* ==========================================================  IFC  ========================================================== */
#define FRC_IFC_TXDONE_Pos                (0UL)                     /*!< TXDONE (Bit 0)                                        */
#define FRC_IFC_TXDONE_Msk                (0x1UL)                   /*!< TXDONE (Bitfield-Mask: 0x01)                          */
#define FRC_IFC_TXAFTERFRAMEDONE_Pos      (1UL)                     /*!< TXAFTERFRAMEDONE (Bit 1)                              */
#define FRC_IFC_TXAFTERFRAMEDONE_Msk      (0x2UL)                   /*!< TXAFTERFRAMEDONE (Bitfield-Mask: 0x01)                */
#define FRC_IFC_TXABORTED_Pos             (2UL)                     /*!< TXABORTED (Bit 2)                                     */
#define FRC_IFC_TXABORTED_Msk             (0x4UL)                   /*!< TXABORTED (Bitfield-Mask: 0x01)                       */
#define FRC_IFC_TXUF_Pos                  (3UL)                     /*!< TXUF (Bit 3)                                          */
#define FRC_IFC_TXUF_Msk                  (0x8UL)                   /*!< TXUF (Bitfield-Mask: 0x01)                            */
#define FRC_IFC_RXDONE_Pos                (4UL)                     /*!< RXDONE (Bit 4)                                        */
#define FRC_IFC_RXDONE_Msk                (0x10UL)                  /*!< RXDONE (Bitfield-Mask: 0x01)                          */
#define FRC_IFC_RXABORTED_Pos             (5UL)                     /*!< RXABORTED (Bit 5)                                     */
#define FRC_IFC_RXABORTED_Msk             (0x20UL)                  /*!< RXABORTED (Bitfield-Mask: 0x01)                       */
#define FRC_IFC_FRAMEERROR_Pos            (6UL)                     /*!< FRAMEERROR (Bit 6)                                    */
#define FRC_IFC_FRAMEERROR_Msk            (0x40UL)                  /*!< FRAMEERROR (Bitfield-Mask: 0x01)                      */
#define FRC_IFC_BLOCKERROR_Pos            (7UL)                     /*!< BLOCKERROR (Bit 7)                                    */
#define FRC_IFC_BLOCKERROR_Msk            (0x80UL)                  /*!< BLOCKERROR (Bitfield-Mask: 0x01)                      */
#define FRC_IFC_RXOF_Pos                  (8UL)                     /*!< RXOF (Bit 8)                                          */
#define FRC_IFC_RXOF_Msk                  (0x100UL)                 /*!< RXOF (Bitfield-Mask: 0x01)                            */
#define FRC_IFC_WCNTCMP0_Pos              (9UL)                     /*!< WCNTCMP0 (Bit 9)                                      */
#define FRC_IFC_WCNTCMP0_Msk              (0x200UL)                 /*!< WCNTCMP0 (Bitfield-Mask: 0x01)                        */
#define FRC_IFC_WCNTCMP1_Pos              (10UL)                    /*!< WCNTCMP1 (Bit 10)                                     */
#define FRC_IFC_WCNTCMP1_Msk              (0x400UL)                 /*!< WCNTCMP1 (Bitfield-Mask: 0x01)                        */
#define FRC_IFC_WCNTCMP2_Pos              (11UL)                    /*!< WCNTCMP2 (Bit 11)                                     */
#define FRC_IFC_WCNTCMP2_Msk              (0x800UL)                 /*!< WCNTCMP2 (Bitfield-Mask: 0x01)                        */
#define FRC_IFC_ADDRERROR_Pos             (12UL)                    /*!< ADDRERROR (Bit 12)                                    */
#define FRC_IFC_ADDRERROR_Msk             (0x1000UL)                /*!< ADDRERROR (Bitfield-Mask: 0x01)                       */
#define FRC_IFC_BUSERROR_Pos              (13UL)                    /*!< BUSERROR (Bit 13)                                     */
#define FRC_IFC_BUSERROR_Msk              (0x2000UL)                /*!< BUSERROR (Bitfield-Mask: 0x01)                        */
#define FRC_IFC_RXRAWEVENT_Pos            (14UL)                    /*!< RXRAWEVENT (Bit 14)                                   */
#define FRC_IFC_RXRAWEVENT_Msk            (0x4000UL)                /*!< RXRAWEVENT (Bitfield-Mask: 0x01)                      */
#define FRC_IFC_TXRAWEVENT_Pos            (15UL)                    /*!< TXRAWEVENT (Bit 15)                                   */
#define FRC_IFC_TXRAWEVENT_Msk            (0x8000UL)                /*!< TXRAWEVENT (Bitfield-Mask: 0x01)                      */
#define FRC_IFC_SNIFFOF_Pos               (16UL)                    /*!< SNIFFOF (Bit 16)                                      */
#define FRC_IFC_SNIFFOF_Msk               (0x10000UL)               /*!< SNIFFOF (Bitfield-Mask: 0x01)                         */
#define FRC_IFC_LVDSWILLERROR_Pos         (17UL)                    /*!< LVDSWILLERROR (Bit 17)                                */
#define FRC_IFC_LVDSWILLERROR_Msk         (0x20000UL)               /*!< LVDSWILLERROR (Bitfield-Mask: 0x01)                   */
#define FRC_IFC_LVDSERROR_Pos             (18UL)                    /*!< LVDSERROR (Bit 18)                                    */
#define FRC_IFC_LVDSERROR_Msk             (0x40000UL)               /*!< LVDSERROR (Bitfield-Mask: 0x01)                       */
/* ==========================================================  IEN  ========================================================== */
#define FRC_IEN_TXDONE_Pos                (0UL)                     /*!< TXDONE (Bit 0)                                        */
#define FRC_IEN_TXDONE_Msk                (0x1UL)                   /*!< TXDONE (Bitfield-Mask: 0x01)                          */
#define FRC_IEN_TXAFTERFRAMEDONE_Pos      (1UL)                     /*!< TXAFTERFRAMEDONE (Bit 1)                              */
#define FRC_IEN_TXAFTERFRAMEDONE_Msk      (0x2UL)                   /*!< TXAFTERFRAMEDONE (Bitfield-Mask: 0x01)                */
#define FRC_IEN_TXABORTED_Pos             (2UL)                     /*!< TXABORTED (Bit 2)                                     */
#define FRC_IEN_TXABORTED_Msk             (0x4UL)                   /*!< TXABORTED (Bitfield-Mask: 0x01)                       */
#define FRC_IEN_TXUF_Pos                  (3UL)                     /*!< TXUF (Bit 3)                                          */
#define FRC_IEN_TXUF_Msk                  (0x8UL)                   /*!< TXUF (Bitfield-Mask: 0x01)                            */
#define FRC_IEN_RXDONE_Pos                (4UL)                     /*!< RXDONE (Bit 4)                                        */
#define FRC_IEN_RXDONE_Msk                (0x10UL)                  /*!< RXDONE (Bitfield-Mask: 0x01)                          */
#define FRC_IEN_RXABORTED_Pos             (5UL)                     /*!< RXABORTED (Bit 5)                                     */
#define FRC_IEN_RXABORTED_Msk             (0x20UL)                  /*!< RXABORTED (Bitfield-Mask: 0x01)                       */
#define FRC_IEN_FRAMEERROR_Pos            (6UL)                     /*!< FRAMEERROR (Bit 6)                                    */
#define FRC_IEN_FRAMEERROR_Msk            (0x40UL)                  /*!< FRAMEERROR (Bitfield-Mask: 0x01)                      */
#define FRC_IEN_BLOCKERROR_Pos            (7UL)                     /*!< BLOCKERROR (Bit 7)                                    */
#define FRC_IEN_BLOCKERROR_Msk            (0x80UL)                  /*!< BLOCKERROR (Bitfield-Mask: 0x01)                      */
#define FRC_IEN_RXOF_Pos                  (8UL)                     /*!< RXOF (Bit 8)                                          */
#define FRC_IEN_RXOF_Msk                  (0x100UL)                 /*!< RXOF (Bitfield-Mask: 0x01)                            */
#define FRC_IEN_WCNTCMP0_Pos              (9UL)                     /*!< WCNTCMP0 (Bit 9)                                      */
#define FRC_IEN_WCNTCMP0_Msk              (0x200UL)                 /*!< WCNTCMP0 (Bitfield-Mask: 0x01)                        */
#define FRC_IEN_WCNTCMP1_Pos              (10UL)                    /*!< WCNTCMP1 (Bit 10)                                     */
#define FRC_IEN_WCNTCMP1_Msk              (0x400UL)                 /*!< WCNTCMP1 (Bitfield-Mask: 0x01)                        */
#define FRC_IEN_WCNTCMP2_Pos              (11UL)                    /*!< WCNTCMP2 (Bit 11)                                     */
#define FRC_IEN_WCNTCMP2_Msk              (0x800UL)                 /*!< WCNTCMP2 (Bitfield-Mask: 0x01)                        */
#define FRC_IEN_ADDRERROR_Pos             (12UL)                    /*!< ADDRERROR (Bit 12)                                    */
#define FRC_IEN_ADDRERROR_Msk             (0x1000UL)                /*!< ADDRERROR (Bitfield-Mask: 0x01)                       */
#define FRC_IEN_BUSERROR_Pos              (13UL)                    /*!< BUSERROR (Bit 13)                                     */
#define FRC_IEN_BUSERROR_Msk              (0x2000UL)                /*!< BUSERROR (Bitfield-Mask: 0x01)                        */
#define FRC_IEN_RXRAWEVENT_Pos            (14UL)                    /*!< RXRAWEVENT (Bit 14)                                   */
#define FRC_IEN_RXRAWEVENT_Msk            (0x4000UL)                /*!< RXRAWEVENT (Bitfield-Mask: 0x01)                      */
#define FRC_IEN_TXRAWEVENT_Pos            (15UL)                    /*!< TXRAWEVENT (Bit 15)                                   */
#define FRC_IEN_TXRAWEVENT_Msk            (0x8000UL)                /*!< TXRAWEVENT (Bitfield-Mask: 0x01)                      */
#define FRC_IEN_SNIFFOF_Pos               (16UL)                    /*!< SNIFFOF (Bit 16)                                      */
#define FRC_IEN_SNIFFOF_Msk               (0x10000UL)               /*!< SNIFFOF (Bitfield-Mask: 0x01)                         */
#define FRC_IEN_LVDSWILLERROR_Pos         (17UL)                    /*!< LVDSWILLERROR (Bit 17)                                */
#define FRC_IEN_LVDSWILLERROR_Msk         (0x20000UL)               /*!< LVDSWILLERROR (Bitfield-Mask: 0x01)                   */
#define FRC_IEN_LVDSERROR_Pos             (18UL)                    /*!< LVDSERROR (Bit 18)                                    */
#define FRC_IEN_LVDSERROR_Msk             (0x40000UL)               /*!< LVDSERROR (Bitfield-Mask: 0x01)                       */
#define FRC_IEN_FRAMEDETPAUSED_Pos        (24UL)                    /*!< FRAMEDETPAUSED (Bit 24)                               */
#define FRC_IEN_FRAMEDETPAUSED_Msk        (0x1000000UL)             /*!< FRAMEDETPAUSED (Bitfield-Mask: 0x01)                  */
#define FRC_IEN_INTERLEAVEWRITEPAUSED_Pos (25UL)                    /*!< INTERLEAVEWRITEPAUSED (Bit 25)                        */
#define FRC_IEN_INTERLEAVEWRITEPAUSED_Msk (0x2000000UL)             /*!< INTERLEAVEWRITEPAUSED (Bitfield-Mask: 0x01)           */
#define FRC_IEN_INTERLEAVEREADPAUSED_Pos  (26UL)                    /*!< INTERLEAVEREADPAUSED (Bit 26)                         */
#define FRC_IEN_INTERLEAVEREADPAUSED_Msk  (0x4000000UL)             /*!< INTERLEAVEREADPAUSED (Bitfield-Mask: 0x01)            */
