VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_frc.h
#define FRC_IEN_TXSUBFRAMEPAUSED_Pos      (27UL)                    /*!< TXSUBFRAMEPAUSED (Bit 27)                             */
#define FRC_IEN_TXSUBFRAMEPAUSED_Msk      (0x8000000UL)             /*!< TXSUBFRAMEPAUSED (Bitfield-Mask: 0x01)                */
#define FRC_IEN_CONVPAUSED_Pos            (28UL)                    /*!< CONVPAUSED (Bit 28)                                   */
#define FRC_IEN_CONVPAUSED_Msk            (0x10000000UL)            /*!< CONVPAUSED (Bitfield-Mask: 0x01)                      */
#define FRC_IEN_RXWORD_Pos                (29UL)                    /*!< RXWORD (Bit 29)                                       */
#define FRC_IEN_RXWORD_Msk                (0x20000000UL)            /*!< RXWORD (Bitfield-Mask: 0x01)                          */
#define FRC_IEN_TXWORD_Pos                (30UL)                    /*!< TXWORD (Bit 30)                                       */
#define FRC_IEN_TXWORD_Msk                (0x40000000UL)            /*!< TXWORD (Bitfield-Mask: 0x01)                          */
/* ======================================================  BUFFERMODE  ======================================================= */
#define FRC_BUFFERMODE_TXBUFFERMODE_Pos   (0UL)                     /*!< TXBUFFERMODE (Bit 0)                                  */
#define FRC_BUFFERMODE_TXBUFFERMODE_Msk   (0x1UL)                   /*!< TXBUFFERMODE (Bitfield-Mask: 0x01)                    */
#define FRC_BUFFERMODE_RXBUFFERMODE_Pos   (1UL)                     /*!< RXBUFFERMODE (Bit 1)                                  */
#define FRC_BUFFERMODE_RXBUFFERMODE_Msk   (0x6UL)                   /*!< RXBUFFERMODE (Bitfield-Mask: 0x03)                    */
/* =======================================================  ROUTEPEN  ======================================================== */
#define FRC_ROUTEPEN_DOUTPEN_Pos          (0UL)                     /*!< DOUTPEN (Bit 0)                                       */
#define FRC_ROUTEPEN_DOUTPEN_Msk          (0x1UL)                   /*!< DOUTPEN (Bitfield-Mask: 0x01)                         */
#define FRC_ROUTEPEN_DCLKPEN_Pos          (1UL)                     /*!< DCLKPEN (Bit 1)                                       */
#define FRC_ROUTEPEN_DCLKPEN_Msk          (0x2UL)                   /*!< DCLKPEN (Bitfield-Mask: 0x01)                         */
#define FRC_ROUTEPEN_DFRAMEPEN_Pos        (2UL)                     /*!< DFRAMEPEN (Bit 2)                                     */
#define FRC_ROUTEPEN_DFRAMEPEN_Msk        (0x4UL)                   /*!< DFRAMEPEN (Bitfield-Mask: 0x01)                       */
/* =======================================================  ROUTELOC0  ======================================================= */
#define FRC_ROUTELOC0_DOUTLOC_Pos         (0UL)                     /*!< DOUTLOC (Bit 0)                                       */
#define FRC_ROUTELOC0_DOUTLOC_Msk         (0x3fUL)                  /*!< DOUTLOC (Bitfield-Mask: 0x3f)                         */
#define FRC_ROUTELOC0_DCLKLOC_Pos         (8UL)                     /*!< DCLKLOC (Bit 8)                                       */
#define FRC_ROUTELOC0_DCLKLOC_Msk         (0x3f00UL)                /*!< DCLKLOC (Bitfield-Mask: 0x3f)                         */
#define FRC_ROUTELOC0_DFRAMELOC_Pos       (16UL)                    /*!< DFRAMELOC (Bit 16)                                    */
#define FRC_ROUTELOC0_DFRAMELOC_Msk       (0x3f0000UL)              /*!< DFRAMELOC (Bitfield-Mask: 0x3f)                       */
/* =======================================================  SNIFFCTRL  ======================================================= */
#define FRC_SNIFFCTRL_SNIFFMODE_Pos       (0UL)                     /*!< SNIFFMODE (Bit 0)                                     */
#define FRC_SNIFFCTRL_SNIFFMODE_Msk       (0x3UL)                   /*!< SNIFFMODE (Bitfield-Mask: 0x03)                       */
#define FRC_SNIFFCTRL_SNIFFBITS_Pos       (2UL)                     /*!< SNIFFBITS (Bit 2)                                     */
#define FRC_SNIFFCTRL_SNIFFBITS_Msk       (0x4UL)                   /*!< SNIFFBITS (Bitfield-Mask: 0x01)                       */
#define FRC_SNIFFCTRL_SNIFFRXDATA_Pos     (3UL)                     /*!< SNIFFRXDATA (Bit 3)                                   */
#define FRC_SNIFFCTRL_SNIFFRXDATA_Msk     (0x8UL)                   /*!< SNIFFRXDATA (Bitfield-Mask: 0x01)                     */
#define FRC_SNIFFCTRL_SNIFFTXDATA_Pos     (4UL)                     /*!< SNIFFTXDATA (Bit 4)                                   */
#define FRC_SNIFFCTRL_SNIFFTXDATA_Msk     (0x10UL)                  /*!< SNIFFTXDATA (Bitfield-Mask: 0x01)                     */
#define FRC_SNIFFCTRL_SNIFFRSSI_Pos       (5UL)                     /*!< SNIFFRSSI (Bit 5)                                     */
#define FRC_SNIFFCTRL_SNIFFRSSI_Msk       (0x20UL)                  /*!< SNIFFRSSI (Bitfield-Mask: 0x01)                       */
#define FRC_SNIFFCTRL_SNIFFSTATE_Pos      (6UL)                     /*!< SNIFFSTATE (Bit 6)                                    */
#define FRC_SNIFFCTRL_SNIFFSTATE_Msk      (0x40UL)                  /*!< SNIFFSTATE (Bitfield-Mask: 0x01)                      */
#define FRC_SNIFFCTRL_SNIFFAUXDATA_Pos    (7UL)                     /*!< SNIFFAUXDATA (Bit 7)                                  */
#define FRC_SNIFFCTRL_SNIFFAUXDATA_Msk    (0x80UL)                  /*!< SNIFFAUXDATA (Bitfield-Mask: 0x01)                    */
#define FRC_SNIFFCTRL_SNIFFBR_Pos         (8UL)                     /*!< SNIFFBR (Bit 8)                                       */
#define FRC_SNIFFCTRL_SNIFFBR_Msk         (0xff00UL)                /*!< SNIFFBR (Bitfield-Mask: 0xff)                         */
#define FRC_SNIFFCTRL_SNIFFSLEEPCTRL_Pos  (16UL)                    /*!< SNIFFSLEEPCTRL (Bit 16)                               */
#define FRC_SNIFFCTRL_SNIFFSLEEPCTRL_Msk  (0x10000UL)               /*!< SNIFFSLEEPCTRL (Bitfield-Mask: 0x01)                  */
/* ========================================================  AUXDATA  ======================================================== */
#define FRC_AUXDATA_AUXDATA_Pos           (0UL)                     /*!< AUXDATA (Bit 0)                                       */
#define FRC_AUXDATA_AUXDATA_Msk           (0x1ffUL)                 /*!< AUXDATA (Bitfield-Mask: 0x1ff)                        */
/* ========================================================  RAWCTRL  ======================================================== */
#define FRC_RAWCTRL_TXRAWMODE_Pos         (0UL)                     /*!< TXRAWMODE (Bit 0)                                     */
#define FRC_RAWCTRL_TXRAWMODE_Msk         (0x3UL)                   /*!< TXRAWMODE (Bitfield-Mask: 0x03)                       */
#define FRC_RAWCTRL_RXRAWMODE_Pos         (2UL)                     /*!< RXRAWMODE (Bit 2)                                     */
#define FRC_RAWCTRL_RXRAWMODE_Msk         (0x1cUL)                  /*!< RXRAWMODE (Bitfield-Mask: 0x07)                       */
#define FRC_RAWCTRL_RXRAWRANDOM_Pos       (5UL)                     /*!< RXRAWRANDOM (Bit 5)                                   */
#define FRC_RAWCTRL_RXRAWRANDOM_Msk       (0x20UL)                  /*!< RXRAWRANDOM (Bitfield-Mask: 0x01)                     */
#define FRC_RAWCTRL_RXRAWTRIGGER_Pos      (7UL)                     /*!< RXRAWTRIGGER (Bit 7)                                  */
#define FRC_RAWCTRL_RXRAWTRIGGER_Msk      (0x80UL)                  /*!< RXRAWTRIGGER (Bitfield-Mask: 0x01)                    */
#define FRC_RAWCTRL_RXRAWPRSSEL_Pos       (8UL)                     /*!< RXRAWPRSSEL (Bit 8)                                   */
#define FRC_RAWCTRL_RXRAWPRSSEL_Msk       (0xf00UL)                 /*!< RXRAWPRSSEL (Bitfield-Mask: 0x0f)                     */
/* =======================================================  RXRAWDATA  ======================================================= */
#define FRC_RXRAWDATA_RXRAWDATA_Pos       (0UL)                     /*!< RXRAWDATA (Bit 0)                                     */
#define FRC_RXRAWDATA_RXRAWDATA_Msk       (0xffffffffUL)            /*!< RXRAWDATA (Bitfield-Mask: 0xffffffff)                 */
/* =======================================================  PAUSEDATA  ======================================================= */
#define FRC_PAUSEDATA_PAUSEDATA_Pos       (0UL)                     /*!< PAUSEDATA (Bit 0)                                     */
#define FRC_PAUSEDATA_PAUSEDATA_Msk       (0x3fUL)                  /*!< PAUSEDATA (Bitfield-Mask: 0x3f)                       */
/* ====================================================  LIKELYCONVSTATE  ==================================================== */
#define FRC_LIKELYCONVSTATE_LIKELYCONVSTATE_Pos (0UL)               /*!< LIKELYCONVSTATE (Bit 0)                               */
#define FRC_LIKELYCONVSTATE_LIKELYCONVSTATE_Msk (0x3fUL)            /*!< LIKELYCONVSTATE (Bitfield-Mask: 0x3f)                 */
/* ====================================================  INTELEMENTNEXT  ===================================================== */
#define FRC_INTELEMENTNEXT_INTELEMENTNEXT_Pos (0UL)                 /*!< INTELEMENTNEXT (Bit 0)                                */
#define FRC_INTELEMENTNEXT_INTELEMENTNEXT_Msk (0xffUL)              /*!< INTELEMENTNEXT (Bitfield-Mask: 0xff)                  */
/* =====================================================  INTWRITEPOINT  ===================================================== */
#define FRC_INTWRITEPOINT_INTWRITEPOINT_Pos (0UL)                   /*!< INTWRITEPOINT (Bit 0)                                 */
#define FRC_INTWRITEPOINT_INTWRITEPOINT_Msk (0x1fUL)                /*!< INTWRITEPOINT (Bitfield-Mask: 0x1f)                   */
/* =====================================================  INTREADPOINT  ====================================================== */
#define FRC_INTREADPOINT_INTREADPOINT_Pos (0UL)                     /*!< INTREADPOINT (Bit 0)                                  */
#define FRC_INTREADPOINT_INTREADPOINT_Msk (0x1fUL)                  /*!< INTREADPOINT (Bitfield-Mask: 0x1f)                    */
/* =========================================================  FCD0  ========================================================== */
#define FRC_FCD0_WORDS_Pos                (0UL)                     /*!< WORDS (Bit 0)                                         */
#define FRC_FCD0_WORDS_Msk                (0xffUL)                  /*!< WORDS (Bitfield-Mask: 0xff)                           */
#define FRC_FCD0_BUFFER_Pos               (8UL)                     /*!< BUFFER (Bit 8)                                        */
#define FRC_FCD0_BUFFER_Msk               (0x300UL)                 /*!< BUFFER (Bitfield-Mask: 0x03)                          */
#define FRC_FCD0_INCLUDECRC_Pos           (10UL)                    /*!< INCLUDECRC (Bit 10)                                   */
#define FRC_FCD0_INCLUDECRC_Msk           (0x400UL)                 /*!< INCLUDECRC (Bitfield-Mask: 0x01)                      */
#define FRC_FCD0_CALCCRC_Pos              (11UL)                    /*!< CALCCRC (Bit 11)                                      */
#define FRC_FCD0_CALCCRC_Msk              (0x800UL)                 /*!< CALCCRC (Bitfield-Mask: 0x01)                         */
#define FRC_FCD0_SKIPCRC_Pos              (12UL)                    /*!< SKIPCRC (Bit 12)                                      */
#define FRC_FCD0_SKIPCRC_Msk              (0x3000UL)                /*!< SKIPCRC (Bitfield-Mask: 0x03)                         */
#define FRC_FCD0_SKIPWHITE_Pos            (14UL)                    /*!< SKIPWHITE (Bit 14)                                    */
#define FRC_FCD0_SKIPWHITE_Msk            (0x4000UL)                /*!< SKIPWHITE (Bitfield-Mask: 0x01)                       */
/* =========================================================  FCD1  ========================================================== */
#define FRC_FCD1_WORDS_Pos                (0UL)                     /*!< WORDS (Bit 0)                                         */
#define FRC_FCD1_WORDS_Msk                (0xffUL)                  /*!< WORDS (Bitfield-Mask: 0xff)                           */
#define FRC_FCD1_BUFFER_Pos               (8UL)                     /*!< BUFFER (Bit 8)                                        */
#define FRC_FCD1_BUFFER_Msk               (0x300UL)                 /*!< BUFFER (Bitfield-Mask: 0x03)                          */
#define FRC_FCD1_INCLUDECRC_Pos           (10UL)                    /*!< INCLUDECRC (Bit 10)                                   */
#define FRC_FCD1_INCLUDECRC_Msk           (0x400UL)                 /*!< INCLUDECRC (Bitfield-Mask: 0x01)                      */
#define FRC_FCD1_CALCCRC_Pos              (11UL)                    /*!< CALCCRC (Bit 11)                                      */
#define FRC_FCD1_CALCCRC_Msk              (0x800UL)                 /*!< CALCCRC (Bitfield-Mask: 0x01)                         */
#define FRC_FCD1_SKIPCRC_Pos              (12UL)                    /*!< SKIPCRC (Bit 12)                                      */
#define FRC_FCD1_SKIPCRC_Msk              (0x3000UL)                /*!< SKIPCRC (Bitfield-Mask: 0x03)                         */
#define FRC_FCD1_SKIPWHITE_Pos            (14UL)                    /*!< SKIPWHITE (Bit 14)                                    */
#define FRC_FCD1_SKIPWHITE_Msk            (0x4000UL)                /*!< SKIPWHITE (Bitfield-Mask: 0x01)                       */
/* =========================================================  FCD2  ========================================================== */
#define FRC_FCD2_WORDS_Pos                (0UL)                     /*!< WORDS (Bit 0)                                         */
#define FRC_FCD2_WORDS_Msk                (0xffUL)                  /*!< WORDS (Bitfield-Mask: 0xff)                           */
#define FRC_FCD2_BUFFER_Pos               (8UL)                     /*!< BUFFER (Bit 8)                                        */
#define FRC_FCD2_BUFFER_Msk               (0x300UL)                 /*!< BUFFER (Bitfield-Mask: 0x03)                          */
#define FRC_FCD2_INCLUDECRC_Pos           (10UL)                    /*!< INCLUDECRC (Bit 10)                                   */
#define FRC_FCD2_INCLUDECRC_Msk           (0x400UL)                 /*!< INCLUDECRC (Bitfield-Mask: 0x01)                      */
#define FRC_FCD2_CALCCRC_Pos              (11UL)                    /*!< CALCCRC (Bit 11)                                      */
#define FRC_FCD2_CALCCRC_Msk              (0x800UL)                 /*!< CALCCRC (Bitfield-Mask: 0x01)                         */
#define FRC_FCD2_SKIPCRC_Pos              (12UL)                    /*!< SKIPCRC (Bit 12)                                      */
#define FRC_FCD2_SKIPCRC_Msk              (0x3000UL)                /*!< SKIPCRC (Bitfield-Mask: 0x03)                         */
#define FRC_FCD2_SKIPWHITE_Pos            (14UL)                    /*!< SKIPWHITE (Bit 14)                                    */
#define FRC_FCD2_SKIPWHITE_Msk            (0x4000UL)                /*!< SKIPWHITE (Bitfield-Mask: 0x01)                       */
/* =========================================================  FCD3  ========================================================== */
#define FRC_FCD3_WORDS_Pos                (0UL)                     /*!< WORDS (Bit 0)                                         */
#define FRC_FCD3_WORDS_Msk                (0xffUL)                  /*!< WORDS (Bitfield-Mask: 0xff)                           */
#define FRC_FCD3_BUFFER_Pos               (8UL)                     /*!< BUFFER (Bit 8)                                        */
#define FRC_FCD3_BUFFER_Msk               (0x300UL)                 /*!< BUFFER (Bitfield-Mask: 0x03)                          */
#define FRC_FCD3_INCLUDECRC_Pos           (10UL)                    /*!< INCLUDECRC (Bit 10)                                   */
#define FRC_FCD3_INCLUDECRC_Msk           (0x400UL)                 /*!< INCLUDECRC (Bitfield-Mask: 0x01)                      */
#define FRC_FCD3_CALCCRC_Pos              (11UL)                    /*!< CALCCRC (Bit 11)                                      */
#define FRC_FCD3_CALCCRC_Msk              (0x800UL)                 /*!< CALCCRC (Bitfield-Mask: 0x01)                         */
#define FRC_FCD3_SKIPCRC_Pos              (12UL)                    /*!< SKIPCRC (Bit 12)                                      */
#define FRC_FCD3_SKIPCRC_Msk              (0x3000UL)                /*!< SKIPCRC (Bitfield-Mask: 0x03)                         */
#define FRC_FCD3_SKIPWHITE_Pos            (14UL)                    /*!< SKIPWHITE (Bit 14)                                    */
#define FRC_FCD3_SKIPWHITE_Msk            (0x4000UL)                /*!< SKIPWHITE (Bitfield-Mask: 0x01)                       */
/* ======================================================  INTELEMENT0  ====================================================== */
#define FRC_INTELEMENT0_INTELEMENT_Pos    (0UL)                     /*!< INTELEMENT (Bit 0)                                    */
#define FRC_INTELEMENT0_INTELEMENT_Msk    (0xffUL)                  /*!< INTELEMENT (Bitfield-Mask: 0xff)                      */
/* ======================================================  INTELEMENT1  ====================================================== */
#define FRC_INTELEMENT1_INDEXMINATTEN_Pos (0UL)                     /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT1_INDEXMINATTEN_Msk (0xffUL)                  /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* ======================================================  INTELEMENT2  ====================================================== */
#define FRC_INTELEMENT2_INDEXMINATTEN_Pos (0UL)                     /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT2_INDEXMINATTEN_Msk (0xffUL)                  /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* ======================================================  INTELEMENT3  ====================================================== */
#define FRC_INTELEMENT3_INDEXMINATTEN_Pos (0UL)                     /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT3_INDEXMINATTEN_Msk (0xffUL)                  /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* ======================================================  INTELEMENT4  ====================================================== */
#define FRC_INTELEMENT4_INDEXMINATTEN_Pos (0UL)                     /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT4_INDEXMINATTEN_Msk (0xffUL)                  /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* ======================================================  INTELEMENT5  ====================================================== */
#define FRC_INTELEMENT5_INDEXMINATTEN_Pos (0UL)                     /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT5_INDEXMINATTEN_Msk (0xffUL)                  /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* ======================================================  INTELEMENT6  ====================================================== */
#define FRC_INTELEMENT6_INDEXMINATTEN_Pos (0UL)                     /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT6_INDEXMINATTEN_Msk (0xffUL)                  /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* ======================================================  INTELEMENT7  ====================================================== */
#define FRC_INTELEMENT7_INDEXMINATTEN_Pos (0UL)                     /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT7_INDEXMINATTEN_Msk (0xffUL)                  /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* ======================================================  INTELEMENT8  ====================================================== */
#define FRC_INTELEMENT8_INDEXMINATTEN_Pos (0UL)                     /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT8_INDEXMINATTEN_Msk (0xffUL)                  /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* ======================================================  INTELEMENT9  ====================================================== */
#define FRC_INTELEMENT9_INDEXMINATTEN_Pos (0UL)                     /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT9_INDEXMINATTEN_Msk (0xffUL)                  /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* =====================================================  INTELEMENT10  ====================================================== */
#define FRC_INTELEMENT10_INDEXMINATTEN_Pos (0UL)                    /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT10_INDEXMINATTEN_Msk (0xffUL)                 /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* =====================================================  INTELEMENT11  ====================================================== */
#define FRC_INTELEMENT11_INDEXMINATTEN_Pos (0UL)                    /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT11_INDEXMINATTEN_Msk (0xffUL)                 /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* =====================================================  INTELEMENT12  ====================================================== */
#define FRC_INTELEMENT12_INDEXMINATTEN_Pos (0UL)                    /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT12_INDEXMINATTEN_Msk (0xffUL)                 /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* =====================================================  INTELEMENT13  ====================================================== */
#define FRC_INTELEMENT13_INDEXMINATTEN_Pos (0UL)                    /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT13_INDEXMINATTEN_Msk (0xffUL)                 /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* =====================================================  INTELEMENT14  ====================================================== */
#define FRC_INTELEMENT14_INDEXMINATTEN_Pos (0UL)                    /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT14_INDEXMINATTEN_Msk (0xffUL)                 /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */
/* =====================================================  INTELEMENT15  ====================================================== */
#define FRC_INTELEMENT15_INDEXMINATTEN_Pos (0UL)                    /*!< INDEXMINATTEN (Bit 0)                                 */
#define FRC_INTELEMENT15_INDEXMINATTEN_Msk (0xffUL)                 /*!< INDEXMINATTEN (Bitfield-Mask: 0xff)                   */

/** @} */
/** @} End of group EFR32FG1V_FRC */
/** @} End of group Parts */
